const foodData = {
    "이로운 것": {
        "곡류": [
            "찹쌀", "찹쌀흑미", "카무트(호라산밀)", "강낭콩(양대)", "고구마", "팥", "카사바(타피오카)", 
            "감자", "미강", "찹쌀현미(소화장애시 금지)", "현미", "흑미", "홍국균미", "쌀", "찐쌀", 
            "옥수수", "스(인디언감자)"
        ],
        "야채류": [
            "서목태(쥐눈이콩)", "흑태(콩자반콩)", "이집트콩(병아리콩)", "우엉", "참깨", "아보카도", 
            "땅콩호박", "단호박(호박은 안됨)", "파", "양파", "마늘", "마늘대", "고추", "생강", "흑생강", 
            "겨자", "후추", "산초", "제피", "강황(카레)", "부추(정구지)", "갓", "명이나물", "냉이", 
            "달래", "삼채", "릭", "창출나물", "피망", "파프리카", "고추냉이(와사비)", "염교(학교)", 
            "청겨자잎", "적겨자잎", "가중나물(가죽)", "양하"
        ],
        "육류": [
            "닭(닭발과 껍질은 안됨)", "개", "염소", "양", "노루", "사슴", "오골계", "꿩", "메추라기", 
            "참새", "칠면조", "토끼", "선지", "계란노른자", "메추리알노른자", "염소유", "산양유", 
            "산양분유", "염소유치즈", "산양유치즈", "소고기", "곰탕", "우유", 
            "요구르트(체질에 맞는 재료가 들어간 것)", "소고기장조림", 
            "소고기육포(아질산나트륨이 들어가지 않은 것)"
        ],
        "생선류": [
            "멸치", "뱅어", "미꾸라지", "가물치", "메기(동사리)", "붕어", "잉어", "향어", "각시붕어", 
            "은어", "미노"
        ],
        "해조류/해물류": [
            "미역", "다시마", "김", "오징어", "한치", "문어", "갑오징어", "낙지", "쭈꾸미"
        ],
        "패류/고동류": [
            "굴", "전복", "홍합", "가리비", "새우", "게"
        ],
        "과일류": [
            "석류", "무화과", "망고", "코코넛", "감", "곶감", "대추", "복분자", "아로니아", "블루베리", 
            "구아바", "체리", "파파야", "망고스틴", "용과", "리치", "패션프루츠", "구기자", "산수유", 
            "오미자", "머루", "다래", "다래가루", "마가목열매", "매실", "앵두", "버찌", "모과", "귤", 
            "탱자", "자몽", "오렌지", "레몬", "라임", "포도"
        ],
        "견과류": [
            "아몬드", "캐쉬넛(인도땅콩)", "타이거넛", "사차인치", "피스타치오", "마카다미아", "피칸", 
            "땅콩", "브라질넛", "대추야자씨앗", "코코넛", "올리브"
        ],
        "김치류": [
            "파김치", "부추김치", "갓김치", "고추잎김치", "쑥갓김치", "곰취김치", "취나물김치", 
            "열무김치", "무청김치", "파프리카김치"
        ],
        "젓갈": [
            "조기젓", "소라젓", "토하젓", "굴젓"
        ],
        "차": [
            "수정과", "식혜", "유자차", "모과차", "생강차", "계피차"
        ],
        "식용유": [
            "올리브유", "참기름", "들기름", "홍화유", "해바라기유", "아마씨유", "야자유"
        ],
        "운동": [
            "수영", "물속걷기", "냉수마찰", "아쿠아로빅", "수구", "사우나", "반신욕", "족욕", "냉온욕"
        ],
        "목욕": [
            "냉수목욕(찬물로)", "냉수마찰", "거품목욕", "약품목욕"
        ],
        "색": [
            "주황색", "분홍색", "핑크색", "노란색", "계통"
        ],
        "보석": [
            "다이아몬드", "팔찌", "담황색", "호박석", "제백석", "계피자석", "황석", "참새옥", "황철광"
        ],
        "죽": [
            "당호박죽", "팥죽", "단죽"
        ],
        "기타": [
            "유자", "식초", "유기된장", "된장", "여주", "인삼", "홍삼", "상심자", "복령", "복신"
        ]
    },
    "해로운 것": {
        "곡류": [
            "쌀", "밀가루", "메밀", "현미"
        ],
        "야채류": [
            "고추", "생강", "마늘", "파", "당근", "토마토", "가죽나물", "머위", "쑥"
        ],
        "육류": [
            "소고기", "말고기", "양고기", "사슴고기", "돼지고기", "산양", "산토끼", "삼겹살", "제육", 
            "돼지목살", "닭고기", "오리고기"
        ],
        "생선류": [
            "장어", "고등어", "참치", "광어", "명태", "갈치", "대구", "연어", "복어", "참치"
        ],
        "해조류/해물류": [
            "미역", "다시마", "톳", "멍게", "해삼자루", "해삼"
        ],
        "패류/고동류": [
            "조개류", "굴", "홍합", "바지락", "대합", "소라", "꿀", "우렁"
        ],
        "과일류": [
            "사과", "복숭아", "살구", "참외", "딸기", "자두", "레몬", "오렌지", "자몽", "망고", 
            "청포도", "자몽", "오렌지", "천도복숭아", "토란", "판식고", "올리브", "파인애플", "한라봉"
        ],
        "견과류": [
            "은행", "캐슈넛", "해바라기씨", "들깨", "땅콩"
        ],
        "음료": [
            "커피", "홍차", "알코올류", "탄산음료", "과일주스", "뽕잎차", "결명자차", "녹차", "유자차", 
            "매실차"
        ],
        "기타": [
            "설탕", "인공감미료", "고춧가루", "후추", "겨자", "카레", "꿀", "매실청", "새우젓", 
            "조개젓", "아니스", "가츠오부시", "송화", "밀가루", "검은깨", "들깨가루", "무말랭이", 
            "마늘", "생강", "고춧가루", "양파가루", "파프리카가루"
        ]
    }
}; 